In [1]:
import pandas as pd
import numpy as np 
import plotly.express as px
import os

In [ ]:
for name, value in os.environ.items():
    print("{0}: {1}".format(name, value))

In [ ]:
pip list

In [ ]:
scope2_sum = pd.read_csv("/Users/jdeen@middlebury.edu/Documents/ENV_Dashboard/ENV_Dash/Data/Raw/Summaries/Scope2_Summary.csv")
scope2_sum

In [ ]:
## cleaning up > making it all into a function

def tidy_data(df):
    df_t = df.T
    df_t.columns= df_t.iloc[0]
    df_t.drop(index= df_t.index[0], axis=0, inplace=True) 
    return df_t

In [ ]:
tidied = tidy_data(scope2_sum)

In [ ]:
##sanity check 
tidied

In [ ]:
tidied.columns[0]

In [ ]:
def pivot_df(df):
    restruc = pd.melt(df,id_vars= df.columns[0], value_vars=[df.columns[1],df.columns[2],df.columns[3],df.columns[4],df.columns[5],df.columns[6],df.columns[7],df.columns[8],df.columns[9],df.columns[10],df.columns[11],df.columns[12],df.columns[13]])
    return (restruc)

In [ ]:
pivoted = pivot_df(tidied)# value column represents MTCDEs

In [ ]:
pivoted

In [ ]:
def write_clean_df(df,path,n):
    df.to_csv(f"{path}/{n}.csv")

In [ ]:
write_clean_df(pivoted,"/Users/jdeen@middlebury.edu/Documents/ENV_Dashboard/ENV_Dash/Data/Tidy",'scope2_sums')

In [ ]:
## Transforming dataframe to start getting it into long format 

T_comp_sum= comp_sum.T

T_comp_sum

In [ ]:
## setting values from the first row (variables)to be column names

T_comp_sum.columns= T_comp_sum.iloc[0]
T_comp_sum

In [ ]:
T_comp_sum.drop(index=T_comp_sum.index[0], axis=0, inplace=True)

In [ ]:
T_comp_sum

In [ ]:
T_comp_sum.set_index(['Year'], inplace = True)

In [ ]:
scopes_T = pd.melt(T_comp_sum ,id_vars= "Year", value_vars=["Scope 1","Scope 2","Scope 3","Offsets Internal","Offsets External","Total"])

Oops more data cleaning necessary- need to convert values from text to numeric so they don't show up as categorical in our graphs 
For the overall GHGI inventory, the values representing offsets should be negative, but that was lost in the data cleaning process, so need to add back in for accuracy

In [2]:
overall_comps = pd.read_csv("/Users/jdeen@middlebury.edu/Documents/ENV_Dashboard/ENV_Dash/Data/Tidy/all_scopes.csv")
scope1 = pd.read_csv("/Users/jdeen@middlebury.edu/Documents/ENV_Dashboard/ENV_Dash/Data/Tidy/scope1_sums.csv")
scope2= pd.read_csv("/Users/jdeen@middlebury.edu/Documents/ENV_Dashboard/ENV_Dash/Data/Tidy/scope2_sums.csv")

In [3]:
overall_comps

     Unnamed: 0       Year Scope_Total_MCTDEs      value
0             0  2006_2007            Scope 1  26,957.80
1             1  2007_2008            Scope 1  28,036.60
2             2  2008_2009            Scope 1  25,290.90
3             3  2009_2010            Scope 1  16,689.20
4             4  2010_2011            Scope 1  14,505.30
..          ...        ...                ...        ...
103         103  2019_2020              Total          0
104         104  2020_2021              Total  11,058.20
105         105  2021_2022              Total  10,858.30
106         106  2022_2023              Total   8,860.60
107         107  2023_2024              Total   7,704.70

[108 rows x 4 columns]

In [4]:
#need to convert values from strings (text)to float (numbers with decimals)data types 
overall_comps['value']= overall_comps['value'].str.replace(',', '')#first we need to remove commas from the values so that we don't confuse the computer
#^ we also re assign this back to the dataframe column so that it is saved in our data

overall_comps['value']= overall_comps['value'].astype(float).fillna(0.0)
#then we coerce the data to be a float type and make NA zeros

In [5]:
#sanity check
overall_comps

     Unnamed: 0       Year Scope_Total_MCTDEs    value
0             0  2006_2007            Scope 1  26957.8
1             1  2007_2008            Scope 1  28036.6
2             2  2008_2009            Scope 1  25290.9
3             3  2009_2010            Scope 1  16689.2
4             4  2010_2011            Scope 1  14505.3
..          ...        ...                ...      ...
103         103  2019_2020              Total      0.0
104         104  2020_2021              Total  11058.2
105         105  2021_2022              Total  10858.3
106         106  2022_2023              Total   8860.6
107         107  2023_2024              Total   7704.7

[108 rows x 4 columns]

In [ ]:
#now we need to isolate the offsets external/internal values to make them negative 
alloffsets = overall_comps.loc[(overall_comps['Scope_Total_MCTDEs']=="Offsets Internal") | (overall_comps['Scope_Total_MCTDEs']=="Offsets External")|overall_comps['value']!= 0.0]

In [21]:
condition = overall_comps[(overall_comps['Scope_Total_MCTDEs']=="Offsets Internal") | (overall_comps['Scope_Total_MCTDEs']=="Offsets External")|overall_comps['value']!= 0.0]

In [22]:
condition

     Unnamed: 0       Year Scope_Total_MCTDEs    value
0             0  2006_2007            Scope 1 -26957.8
1             1  2007_2008            Scope 1 -28036.6
2             2  2008_2009            Scope 1 -25290.9
3             3  2009_2010            Scope 1 -16689.2
4             4  2010_2011            Scope 1 -14505.3
..          ...        ...                ...      ...
99           99  2015_2016              Total -13087.3
104         104  2020_2021              Total -11058.2
105         105  2021_2022              Total -10858.3
106         106  2022_2023              Total  -8860.6
107         107  2023_2024              Total  -7704.7

[100 rows x 4 columns]

In [8]:
overall_comps.loc[condition, 'value'] = -overall_comps.loc[condition, 'value']

In [11]:
#sanity check
overall_comps.where(condition)

     Unnamed: 0       Year Scope_Total_MCTDEs    value
0           0.0  2006_2007            Scope 1 -26957.8
1           1.0  2007_2008            Scope 1 -28036.6
2           2.0  2008_2009            Scope 1 -25290.9
3           3.0  2009_2010            Scope 1 -16689.2
4           4.0  2010_2011            Scope 1 -14505.3
..          ...        ...                ...      ...
103         NaN        NaN                NaN      NaN
104       104.0  2020_2021              Total -11058.2
105       105.0  2021_2022              Total -10858.3
106       106.0  2022_2023              Total  -8860.6
107       107.0  2023_2024              Total  -7704.7

[108 rows x 4 columns]

In [ ]:
nonzero= overall_comps.loc[overall_comps['value']!= 0.0]

In [ ]:
overall_comps[alloffsets & nonzero]